type_emoji = {
    "무기": "⚔️",
    "방어구": "🛡️",
    "소모품": "🧪",
    "기타": "📦"
}

stat_emoji = {
    "공격력": "⚔️",
    "방어력": "🛡️",
    "회복량": "❤️",
    "레벨 제한": "📊",
    "가격": "💰"
}

items = {
    "녹슨 검": {
        "이름": "녹슨 검",
        "설명": "오랜 시간과 사용한 흔적이 많은 검",
        "종류": "무기",
        "공격력": 5,
        "레벨 제한": 1,
        "가격": 100,
    },
    "회복 물약 [소]": {
        "이름": "회복 물약 [소]",
        "종류": "소모품",
        "설명": "25의 체력을 회복.",
        "회복량": 25,
        "가격": 25
    },
    "낡은 책": {
        "이름": "낡은 책",
        "설명": "너무 많이 읽어 낡어버린 책이다. 누군가의 메모가 남겨져있다. '-그만 좀 읽어-'",
        "종류": "무기",
        "공격력": 10,
        "레벨 제한": 3,
        "가격": 300
    },
    "가죽 갑옷": {
        "이름": "가죽 갑옷",
        "설명": "이상하게 네모진 가죽 갑옷 이유는 모르겠지만 익숙한 기분이 든다.",
        "종류": "방어구",
        "방어력": 5,
        "레벨 제한": 5,
        "가격": 1500
    },
    "나무 지팡이": {
        "이름": "저주받은 나무 지팡이",
        "설명": "엘프의 눈 앞에서 나무를 베고 만든 나무 지팡이",
        "종류": "무기",
        "공격력": 0,
        "레벨 제한": 0,
        "가격": 1
    },
    "행운의 동전": {
        "이름": "행운의 동전",
        "설명": "이유는 모르겠지만 도파민이 넘쳐기 시작합니다.",
        "종류": "기타",
        "가격": 1000
    }
}